#------------------------------------------------------------------------  
print("Завдання 1")
def function():
    a = int(input('Введіть перше число: '))
    b = int(input('Введіть друге число: '))
    c = int(input('Введіть третє число: '))
    return a + b + c
print(f"Сума цих чисел: {function()}")
#------------------------------------------------------------------------  
print("Завдання 2")
def a1():
    a = input('Введіть своє ім`я: ')
    print(f'{a}, привіт! Давай вернемось у минуло. Введіть назву професії і отримайте результат.')
    c = input('Введіть назву своєї професії: ')
    return c
def a2():
    b = int(input('Скільки вам років: '))
    f = b - 6
    if b > 18:
        w = f - 11
    else:
        w = 'Ви ще не закінчили школу.'
    if a1() == 'вчитель':
        s = w - 6
    else:
        s = w - 4
    print(f'Ну що ж ви закігчили дитячий садок {f} років тому. Закінчили школу {w} років тому. Були студентом {s} років тому.')
a2()
#------------------------------------------------------------------------  
print("Завдання з файла")
print("Завдання 1 a")
import math
def a():
    a = int(input('Введіть радіус основи конуса: '))
    b = int(input('Введіть висоту конуса: '))
    c = (math.pi * a * a * b)/3
    print(f'Об\'єм такого конуса становить: {round(c, 2)}')
a()
print("Завдання 1 b")
def a(a1, b):
    c = (math.pi * a1 * a1 * b)/3
    print(f'Об\'єм такого конуса становить: {round(c, 2)}')
a1 = int(input('Введіть радіус основи конуса: '))
b = int(input('Введіть висоту конуса: '))
a(a1, b)
#------------------------------------------------------------------------ 
print("Завдання 2\nВводити ось так: 23 45")
def a(a, b):
    c = ((int(a[0])*int(a[1]))/2)+((int(b[0])*int(b[1]))/2)
    print(f'Площа таких трикутників становить: {round(c, 1)}')
a1 = input('Введіть катет першого: ').split()
b = input('Введіть катет другого: ').split()
a(a1, b)
#------------------------------------------------------------------------ 
print("Завдання 3 c")
import random
def a():
    c = 0
    d = []
    for i in range(5):
        a = random.randint(1,6)
        c += a
        d.append(str(a))
    print(f"Середнім арифметичним: {', '.join(d)} є {c/2}")
a()
print("Завдання 3 d")
def a(a):
    c = 0
    d = []
    for i in range(5):
        c += a
        d.append(str(a))
        a = random.randint(1,6)
    print(f"Середнім арифметичним: {', '.join(d)} є {c/2}")
a1 = random.randint(1,6)
a(a1)
#------------------------------------------------------------------------ 
print("Завдання 4")
def a(a):
    c = 0
    d = []
    for i in range(3):
        c += pow(a,2)
        d.append(str(a))
        a = random.randint(3,7)
    print(f"Сума квадратів цих чисел: {', '.join(d)} є {c}")
a1 = random.randint(3,7)
a(a1)
#------------------------------------------------------------------------ 
print("Завдання 5")
def a(b):
    a = b[0]
    c = b[2]
    d = b[3]
    b = b[1]
    c = a*b-c/d
    return print(f"{round(c,1)}")
b = [3,5,2,7]
a(b)