#------------------------------------------------------------------------  
print("Завдання 1")
def trees():
    a = ['poplar', 'willow', 'lime']
    print(f'Масив тута: {" ".join(a)}')
trees()
#------------------------------------------------------------------------  
print("Завдання 2")
import math
def a():
    a = int(input('Введіть радіус основи конуса: '))
    b = int(input('Введіть висоту конуса: '))
    c = (math.pi * a * a * b)/3
    print(f'Об\'єм такого конуса становить: {round(c, 2)}')
a()
#------------------------------------------------------------------------  
print("Завдання 3 a")
def a(a1, b):
    c = (math.pi * a1 * a1 * b)/3
    print(f'Об\'єм такого конуса становить: {round(c, 2)}')
a1 = int(input('Введіть радіус основи конуса: '))
b = int(input('Введіть висоту конуса: '))
a(a1, b)
#------------------------------------------------------------------------  
print("Завдання 3 b")
def favorite_book(title):
    print(f"One of my favorite books is \"{title}\"")
a = 'The Lord of the Rings'
favorite_book(a)
#------------------------------------------------------------------------  
print("Завдання 4")
def make_shirt(a, b):
    print(f"Футболка с текстом {b} є тільки {a} розміра")
a = input("Введіть розмір футболки: ")
b = input("Введіть текст фктболки: ")
make_shirt(a, b)
a = 'XL'
b = 'I love Python!'
make_shirt(a, b)
#------------------------------------------------------------------------  
print("Завдання 5\nВводити ось так: 23 45")
def a(a, b):
    c = ((int(a[0])*int(a[1]))/2)+((int(b[0])*int(b[1]))/2)
    print(f'Площа таких трикутників становить: {round(c, 1)}')
a1 = input('Введіть катет першого: ').split()
b = input('Введіть катет другого: ').split()
a(a1, b)
#------------------------------------------------------------------------ 
print("Завдання 6")
import random
def a():
    c = 0
    d = []
    for i in range(5):
        a = random.randint(1,6)
        c += a
        d.append(str(a))
    print(f"Середнім арифметичним: {', '.join(d)} є {c/2}")
a()
#------------------------------------------------------------------------
print("Завдання 7")
def a(a):
    c = 0
    d = []
    for i in range(5):
        c += a
        d.append(str(a))
        a = random.randint(1,6)
    print(f"Середнім арифметичним: {', '.join(d)} є {c/2}")
a1 = random.randint(1,6)
a(a1)
#------------------------------------------------------------------------
print("Завдання 8")
def a(a):
    c = 0
    d = []
    for i in range(3):
        c += pow(a,2)
        d.append(str(a))
        a = random.randint(3,7)
    print(f"Сума квадратів цих чисел: {', '.join(d)} є {c}")
a1 = random.randint(3,7)
a(a1)
#------------------------------------------------------------------------
print("Завдання 9")
def a(b):
    a = b[0]
    c = b[2]
    d = b[3]
    b = b[1]
    c = a*b-c/d
    return print(f"{round(c,1)}")
b = [3,5,2,7]
a(b)
#------------------------------------------------------------------------
print("Завдання 10")
def city_country(b, c):
    print(f"{b}, {c}")
a = 'так'
while a == 'так':
    b = input("Введіть назву міста: ")
    c = input("Введіть назву країни: ")
    city_country(b, c)
    a = input("Бажаєте повторити? ")
#------------------------------------------------------------------------
print("Завдання 11")
def name(a):
    if a == '50':
        b = 'Михайло Грушевський'
    elif a == '20':
        b = 'Іван Франко'
    elif a == '100':
        b = 'Тарас Шевченко'
    elif a == '200':
        b = 'Леся Українка'
    elif a == '500':
        b = 'Григорій Сковорода'
    elif a == '1000':
        b = 'Володимир Вернадський'
    else:
        b = 'Ви введли неправильний номінал'
    if b != 'Ви введли неправильний номінал':
        print(f"На банкоті номаналом у {a} зображено {b}")
    else:
        print(b)
g = 'так'
while g == 'так':
    a = input("Введіть номінал банкноти: ")
    name(a)
    g = input("Бажаєте повторити? ")
#------------------------------------------------------------------------
print("Завдання 12")
def calculator(a, b, c):
    if c == '+':
        d = a + b
    elif c == '-':
        d = a - b
    elif c == '/':
        if b != 0:
            d = a/b
        else:
            d = 'Division by zero!'
    elif c == '*':
        d = a * b
    elif c == 'mod':
        d = a%b
    elif c == 'pow':
        d = pow(a, b)
    elif c == 'div':
        d = a//b
    else:
        d = 'Ви ввели не те число'
    if d != 'Division by zero!' or d != 'Ви ввели не те число':
        print(f"{a} {c} {b} = {d}")
g = 'так'
while g == 'так':
    a = int(input("Введіть перше число: "))
    b = int(input("Введіть друге число: "))
    c = input("Введіть операцію(операції: +, -, /, *, mod, pow, div,): ")
    calculator(a, b, c)
    g = input("Бажаєте повторити? ")