#------------------------------------------------------------------------  
print("Завдання 1")
def a(x, y=5):
    if x>y:
        z = x*y-2*x
    else:
        z = x/y
    print(z)
a(5)
#------------------------------------------------------------------------  
print("Завдання 2")
def a(*x):
    s = 0
    for i in x:
        s += i
    print(s)
a(1,3,5,7,9)
a(6,8,10)
#------------------------------------------------------------------------  
print("Завдання 3")
x = lambda: print(round(3/7 + 5*8/3, 1))
x()
y = lambda x, y: print(round(2*x+x/y, 1))
y(5, 8)
x = lambda x, y: print(round((3*x+5)/(y-2), 1))
x(8, 10)
#------------------------------------------------------------------------  
print("Завдання 4")
def a(x, y=7, *z):
    s = x*y
    l = 1
    for i in z:
        l = l * i
    print(s, l)
a(3)
a(4, 6, 7, 9, 10)
#------------------------------------------------------------------------  
print("Завдання 5")
a10 = 5
b10 = 4
pid_a = input("Введіть скільки разів підняли гирб учні А класу(10 20 33): ").split()
pid_b = input("Введіть скільки разів підняли гирб учні B класу(10 20 33): ").split()
c = 0
j = 0
for i in range(len(pid_a)):
    c += int(pid_a[i])
for i in range(len(pid_b)):
    j += int(pid_b[i])
c = c/a10
j = j/b10
print(round(c/j, 1))
#------------------------------------------------------------------------  
print("Завдання 6")
f1 = input("Введіть скільки приносить прибутку фірми одного району(10 20 33): ").split()
f2 = input("Введіть скільки приносить прибутку фірми другого району(10 20 33): ").split()
f3 = input("Введіть скільки приносить прибутку фірми трєтього району(10 20 33): ").split()
c = 0
j = 0
p = 0
for i in range(len(f1)):
    c += int(f1[i])
for i in range(len(f2)):
    j += int(f2[i])
for i in range(len(f3)):
    p += int(f3[i])
print(c, j, p)