import random
#------------------------------------------------------------------------  
print("Завдання 1")
a = ["звук", "колонка", "кодування", "модель"]
print(a)
#------------------------------------------------------------------------  
print("Завдання 2")
print("Введіть числа ось так: 11 23 34")
a = map(int, input("Вводити тут: ").split())
print(list(a))
#------------------------------------------------------------------------  
print("Завдання 3")
i = 0
b = []
while i != 10:
    a = random.randint(4,10)
    b.append(a)
    i += 1
print(b)
#------------------------------------------------------------------------  
print("Завдання 4")
a = 3
d = 4
i = 0
b = []
while i != 5:
    b.append(a)
    a += a + d
    i += 1
print(b)
#------------------------------------------------------------------------  
print("Завдання 5")
i = 0
sum = 0
b = []
c = []
while i != 7:
    a = random.randint(2,6)
    b.append(str(a))
    c.append(a)
    sum += a
    i += 1
print(f"Сума массива {c}: {' + '.join(b)} = {sum}")
#------------------------------------------------------------------------  
print("Завдання 7")
a = 3
d = 2
i = 0
b = []
с1 = 0
while i != 6:
    b.append(a)
    с1 += a
    a += a * d
    i += 1
c1 = с1/i
print(f"Середне значення масиву{b}: {int(c1)}")