import random
#------------------------------------------------------------------------  
print("Завдання 1")
a = random.randint(1,10)
while a != 10:
    print(a, end=" ")
    a = random.randint(1,10)
#------------------------------------------------------------------------  
print("\nЗавдання 2")
a = random.randint(1,20)
b = 0
while a != 3:
    print(a, end=" ")
    a = random.randint(1,10)
    b += 1
print(f"\nДо 100 біло: {b}")
#------------------------------------------------------------------------  
print("Завдання 3")
a = random.randint(1,100)
b = 0
while a != 100:
    if a%2 == 0:
        print(a, end=" ")
        b += 1
    a = random.randint(1,100)
print(f"\nПарних чисел {b}")
#------------------------------------------------------------------------  
print("Завдання 4")
a = int(input("Введіть число, яке не первищуе 7: "))
sym = 0
if a < 7:
    while a < 8:
        sym += a
        a += 1
    print(sym)
else: 
    print("Ви ввели не правильне число!")
#------------------------------------------------------------------------  
print("Завдання 5")
a = int(input("Введіть число, яке не первищуе 100: "))
while a < 100:
    a += 5
    print(a, end=" ")
#------------------------------------------------------------------------  
print("\nЗавдання 6")
a = [3, 4.5, 6, 7.5, 9]
for i in range(len(a)):
    b = a[i]**3
    print(f"Для {i+1} куба з ребром {a[i]}^3 = {b}")