#----------------------------------------------------------------------
print("Задача 1")
name = int(input("Введіть число: "))
if name >= 3 and name < 6:
    print("Ого! Сходіть на подвiр'я. Весною так красиво і затишно.")
elif name > 5 and name < 8:
    print("Ого! Морозиво смачне? Теж хочу літа!")
elif name > 7 and name < 12:
    print("Ого! Листя на деревах пожовтіли. А ви знали, що восени тварини запасаються на зиму.")
else:
    print("Ого! Вам напевне холодно. Зимою потрібен солодкий чай.")
#----------------------------------------------------------------------
from cmath import sqrt
print("Задача 2 та 3 та 4 та 5")
a = int(input("Введіть довжину 1 сторони трикутника: "))
b = int(input("Введіть довжину 2 сторони трикутника: "))
c = int(input("Введіть довжину 3 сторони трикутника: "))
if a == b and b == c:
    print("Так, цей трикутник є рівносторонім.")
elif a == b and a != c and b != c or a == c and a != b and b != c or c == b and a != c and b != a:
    print("Ні, цей трикутник є рівнобедреним.")
elif a == sqrt(b**2 + c**2):
    print("Ого! Це прямокутний трикутник.")
else:
    print("Ні, це різностороній трикутник.")
#----------------------------------------------------------------------
print("Задача 6")
a = int(input("Введіть довжину 1 сторони трикутника: "))
b = int(input("Введіть довжину 2 сторони трикутника: "))
c = int(input("Введіть довжину 3 сторони трикутника: "))
if a + b > c and a + c > b and c + b > a:
    print("Ура такий трикутник існує!")
else:
    print("Х'юстен в нас проблеми! Такого трикутника не існує!")