#------------------------------------------------------------------------  
print("Завдання 1")
a = 1
while a < 11: # for i in range(1,11):
    print(a)
    a += 1
#------------------------------------------------------------------------  
print("Завдання 2")
a = 1
while a < 21: # for i in range(1,21):
    print(a)
    a += 1
#------------------------------------------------------------------------  
print("Завдання 3")
a = 1
b = 0
while a < 21: # for i in range(1,21):
    b += a
    a += 1
print(b)
#------------------------------------------------------------------------  
print("Завдання 4")
a = int(input("Введіть число: "))
b = 0
while 0 < a: #Якщо включати 1, якщо не треба while 1 < a:   # for i in range(0,a):
    b += a
    a -= 1
print(b)
#------------------------------------------------------------------------  
print("Завдання 5")
a = int(input("Введіть число: "))
b = 0
c = int(input("Введіть число: "))
max1 = max(a,c)
min1 = min(a,c)
min1 += 1
while max1 > min1: #Якщо брати 1 та 7 між ними: 2,3,4,5,6 (7 не включається, а к 1 треба +1)   # for i in range(min1,max1):
    b += min1
    min1 += 1
print(b)
#------------------------------------------------------------------------  
print("Завдання 6")
a = int(input("Введіть число: "))
b = 0
c = int(input("Введіть число: "))
max = max(a,c)
min = min(a,c)
if max % 2 != 0:
    max -= 1
elif max == 1:
    max += 1
if min % 2 != 0:
    min += 1
while max >= min: # for i in range(min+1,max):
    b += min
    min += 2
print(b)
#------------------------------------------------------------------------  
print("Завдання 7")
a = 10 #Дні
b = 10 #Перебігав
c = 10 #Норма
v = 0
a += 1
obw = 0
for i in range(1, a):
    b = b + c/100*b
    print(f"{i+1} дня спортсмен пробіжав {round(b,2)}")
    obw += b
print(f"Спортсмен за {a-1} днів пробіжав {round(obw,2)}")
#------------------------------------------------------------------------  
print("Завдання додатково")
a = 0
b = 64
for i in range(a * 4, int(b / 4)+1):
    g = int((b - a * 4) / 2)
    print(f'Гусей {g}, тоді як кролів {a}')
    a += 1