#------------------------------------------------------------------------  
print("Завдання 1")
print("У готелі 4 поверхи. Що вище поверх, то більше людей там мешкає. На який поверх частіше їздить ліфт?")
answer = input("Введіть відповіть: ")
if answer == "1":
    print("Так це правильна відповідь!")
else:
    print("Х'юстен, в нас проблеми. Це не правильна відповіть!")
#------------------------------------------------------------------------   
print("Завдання 2")
#1
a = 0
print("Чого на ярмарку не купиш?")
answer = input("Введіть відповіть: ")
if answer == "Розуму":
    print("Так це правильна відповідь!")
    a += 1
elif answer == "розуму":
    print("Так це правильна відповідь!")
    a += 1
else:
    print("Х'юстен, в нас проблеми. Це не правильна відповіть!")
#2
print("В якій клітці не тримають ні птахів, ні звірів?")
answer = input("Введіть відповіть: ")
if answer == "У грудній клітці":
    print("Так це правильна відповідь!")
    a += 1
elif answer == "у грудній клітці":
    print("Так це правильна відповідь!")
    a += 1
else:
    print("Х'юстен, в нас проблеми. Це не правильна відповіть!")
#3
print("Що це — десять пальців, а нігтів нема?")
answer = input("Введіть відповіть: ")
if answer == "Рукавиці":
    print("Так це правильна відповідь!")
    a += 1
elif answer == "рукавиці":
    print("Так це правильна відповідь!")
    a += 1
else:
    print("Х'юстен, в нас проблеми. Це не правильна відповіть!")
#4
print("Що можна побачити із заплющеними очима?")
answer = input("Введіть відповіть: ")
if answer == "Сон":
    print("Так це правильна відповідь!")
    a += 1
elif answer == "сон":
    print("Так це правильна відповідь!")
    a += 1
else:
    print("Х'юстен, в нас проблеми. Це не правильна відповіть!")
print("Всього ви відповіли правильно на: " + str(a) + " питаня.")
#------------------------------------------------------------------------  
print("Завдання 3")
a = int(input("Введіть довжину сторони: "))
k = int(input("Введіть кількість Робінзонів: "))
n = int(input("Скільки повино припадати на 1 Робінзона площі: "))
a *= a
pl = a/k
if pl == n:
    print("Ні, не порушено. На 1 Робінзона припадає: " + str(pl))
elif pl>n:
    print("Ні, не порушено. На 1 Робінзона припадає: " + str(pl))
else:
    print(f"Як так на 1 Робінзона повино припадати {n} м^2 площі, а припадає лище {pl}")
#------------------------------------------------------------------------  
print("Домашня робота")
a = int(input("Введіть довжину сторони: "))
k = int(input("Введіть кількість Робінзонів: "))
n = int(input("Скільки повино припадати на 1 Робінзона площі: "))
a *= a
pl = a/k
if pl == n:
    print("Ні, не порушено. На 1 Робінзона припадає: " + str(pl))
elif pl>n:
    print("Ні, не порушено. На 1 Робінзона припадає: " + str(pl))
else:
    print(f"Як так на 1 Робінзона повино припадати {n} м^2 площі, а припадає лище {pl}\nНе вистачае {n-pl} м^2 площі, щоб всі жили добре. Тому я дарую їм ще {(n*a)-a} м^2 площі")