#------------------------------------------------------------------------  
print("Завдання 1")
a = int(input("Введіть число:"))
b = int(input("Введіть число:"))
if a > b:
    print(f"a > b, тому що {a} > {b}")
elif a < b:
    print(f"a < b, тому що {a} < {b}")
else:
    print(f"a = b, тому що {a} = {b}")
#------------------------------------------------------------------------  
print("Завдання 2")
a = int(input("Введіть скільки важить Наталка:"))
b = int(input("Введіть скільки важить Богдана:"))
if a > b:
    print(f"Наталка важить {a}")
elif a < b:
    print(f"Богдана важить {b}")
else:
    print(f"Наталка та Богдана важать {b}")
#------------------------------------------------------------------------  
print("Завдання 3")
a = int(input("Введіть число:"))
b = int(input("Введіть число:"))
c = int(input("Введіть число:"))
max = max(a, b, c)
if a > b and a > c or b > a and b > c or c > a and c > b:
    print(f"Число {max} більше всіх")
elif a > b and a == c or a == b and a > c or b > a and b == c or b == a and b > c or c == a and c > b or c > a and c == b:
    print(f"Числа {max} більше всіх")
else:
    print(f"Числа {max} все рівні")
#------------------------------------------------------------------------  
print("Завдання 4")
a = int(input("Введіть розмір бульбашки:"))
b = int(input("Введіть розмір бульбашки:"))
c = int(input("Введіть розмір бульбашки:"))
mas = [a,b,c]
mas.sort(reverse = True)
print(str(mas[0]) + " найбільше значення")
#------------------------------------------------------------------------  
print("Домашне завдання")
a = int(input("Введіть розмір бульбашки:"))
b = int(input("Введіть розмір бульбашки:"))
c = int(input("Введіть розмір бульбашки:"))
a_name = "Артур"
b_name = "Барахлюш"
c_name = "Селенія"
mas = [a,b,c]
mas.sort(reverse = True)
mas[0] = str(mas[0]) + " " + a_name
mas[1] = str(mas[1]) + " " + b_name
mas[2] = str(mas[2]) + " " + c_name
print(mas[0] + " бульбашка переможець")