from random import randint
#------------------------------------------------------------------------  
print("Завдання 1")
a = [45, 23.5, 76, 29, 41]
ma = max(a)
mi = min(a)
print(f"Максимальне значення {ma}, а мінімальне заначення {mi}")
#------------------------------------------------------------------------  
print("Завдання 2")
a = ["В. Глушков", "вчений України"]
a[0] = "В. Глушков – великий"
i = 0
# while i != len(a): # 1 спосіб
#     print(a[i], end=" ")
#     i += 1
# print(a[0], a[1]) # 2 спосіб
print(' '.join(a)) # 3 спосіб
#------------------------------------------------------------------------  
print("Завдання 3")
a = ["Мова", "Pascal"]
b = ["– це мова", "процедурного програмування"]
a.extend(b)
# i = 0
# while i != len(a): # 1 спосіб
#     print(a[i], end=" ")
#     i += 1
print(' '.join(a)) # 2 спосіб
#------------------------------------------------------------------------  
print("Завдання 4")
a = [5, 7, 8, 12, 4]
i = 0
b = 0
while i != len(a):
    if a[i] > 5:
        b += a[i]
    i += 1
print(f"Сума чисел {b}")
#------------------------------------------------------------------------  
print("Завдання 5")
a = [17, 44, 5, 21, 22, 38, 9]
a.remove(max(a))
a.insert(1, 19)
a.sort()
print(a)
#------------------------------------------------------------------------  
print("Завдання 6")
a = []
b = []
for i in range(6):
    a.append(randint(0, 30))
print(a)
i = 0
while i != len(a):
    if min(a) != a[i]:
        b.append(a[i])
    else:
        b.insert(i, 777)
        print(f"Мінаю {a[i]}")
    i += 1
b.append(999)
b.sort()
print(b)