print("Задача 1")#Ця програма містить інформаці. про мене
print("Анастасія Кравченко\nУкраїна\n50026\nКривий Ріг\nСпаська\n8 будинок")
print("Задача 2")#Ця програма може з вами поздороватись
name = input("Введтіь ваше ім'я: ")
print("Привіт, "+name)
print("Задача 3")#Ця програми може порахувати ващі числа
a=float(input("Введіть число a:"))
b=float(input("Введіть число b:"))
sum = round((a + b), 3)
min = round((a - b), 3)
mno = round((a * b), 3)
deli = round((a / b), 3)
deli1 = round((b/a), 3)
print("Їх сума(a+b): "+str(sum)+" . Їх різниця(a-b): "+str(min)+". Їх добуток(a*b): "+str(mno)+" . Їх частка(a/b, b/a): "+str(deli)+" і "+str(float(deli1)))
print("Задача 4")#Ця програма пітставить ваше число під формулу і виведе результат
a = int(input("Введіть число а: "))
a = ((a+2)**3/4)-5 
print("Ваше число: "+str(a))
print("Задача 5")#Ось ця задача буда найскладніша в розумінні, але я впроралась, сподіваюсь) вона виведе всі цілі числа від а до б
a = float(input("Введіть число а: "))
b = float(input("Введіть число b: "))
g=0
g = int(abs(b-(a-1)))
print(f"Між числами {a}, {b} лежить ціле число: {g}")
print("Задача 6")#Ця програма перемножить числа на себе ж та додасть їх, які входять до того ща ви ввели 4-х число чи менше
zile_ny = int(input("Введіть число:"))
zi = zile_ny//1000
zi1 = zile_ny//100%10
le = zile_ny//10%10
le1 = zile_ny%10
zile_ny = zi**2+zi1**2+le**2+le1**2
print(zile_ny)