#----------------------------------------------------------------------
print("Завдання 2")
weather = input("Введіть яка зараз погода: ")
if weather == "сонячно":
    print("Зонтик не потрубен. Кличте друзів та разом йдіть до парку!")
elif weather == "похмуро":
    print("Краще заваріть собі гарячого чаю та посидіть разом з котом за книгою.")
elif weather == "дме сильний вітер":
    print("Беріть гарячий чай, плед, кота та сидіть вдома. Ждемо сонця! Віддайте нам сонце!")
else:
    print("Пограйтеся з котам та подивіться аніме.")
#----------------------------------------------------------------------
print("Завдання 3")
points_color = input("Яким кольором ваш екран у грі? ")
mas = [5,10,15]
if points_color == "зелений":
    print(f"Ви отримали {mas[0]}")
elif points_color == "жовтий":
    print(f"Ви отримали {mas[1]}")
elif points_color == "червоний":
    print(f"Ви отримали {mas[2]}")
else:
    print("Ви зламали гру!")
#----------------------------------------------------------------------
print("Завдання 4")
age = int(input("Введіть свій вік: "))
if age > 0 and age < 2:
    print("Ви немовля, а мені 15 ;) бугага")
elif age > 1 and age < 4:
    print("Ви малюк, а мені 15 ;) бугага")
elif age > 3 and age < 13:
    print("Ви дитина, а мені 15 ;) бугага")
elif age > 12 and age < 20:
    print("Ви підліток, я також відношусь к ним")
elif age > 19 and age < 65:
    print("Ви колись були немовлям, малюкам, дитиною, підлітком, але зараз ви Дорослий!")
else:
    print("Ви вже старичок, я ще ні, але кістки болять так само як і в вас. Піднять коли щось впало - навіщо?")
#----------------------------------------------------------------------
print("Завдання 5")
favorite_fruits = ["яблуко", "апельсин", "виноград"]
why = input("Як ви гадаєте, що з фруктів мені подобається? ")
if why in favorite_fruits:
    print("Так, ви вгадали я це люблю!")
else:
    print("Ні мимо! Мені це не подобається!")
#----------------------------------------------------------------------
print("Завдання 6")
a = [5, 4, 3, 2, 1, 0, 'GO!']
for x in range(len(a)):
    print(a[x])
#----------------------------------------------------------------------
print("Завдання 7")
seasons = ['summer', 'autumn']
months = [ 'july', 'november']
a = list(zip(seasons, months))
print(a)
#----------------------------------------------------------------------
print("Завдання 8")
ctivity = {'business': 'manager', 'it': 'software developer', 'science': 'scientist'}
print(f"business:{ctivity['business']}")
#----------------------------------------------------------------------
print("Завдання 9")
a = range(13)
b = []
for x in a:
    if x%2 == 0:
        b.append(x)
        print(b)
#----------------------------------------------------------------------
print("Завдання 10")
a = range(1, 11)
b = []
for x in a:
    b.append(x**2)
    print(b)